# -*- coding: utf-8 -*-
import room_1
import room_2

# Вывести на консоль жителей комнат (модули room_1 и room_2)
# Формат: В комнате room_1 живут: ...

print(f'В кімнаті room_1 живуть: {room_1.folks}',
      f'\nВ кімнаті roon_2 живуть: {room_2.folks}')
      # OK
