






def main():
    pass
    # todo 1. Вивести всі парні числа від 1 до n. Користувач вводить число n, і програма повинна надрукувати всі парні числа в цьому діапазо0ні.

    # todo 2. Користувач вводить 5 чисел. Програма підраховує та виводить суму тільки додатних чисел.

    # todo 3. Створити програму, яка запитує у користувача число n і виводить таблицю множення для цього числа від 1 до 10.

    # todo 4. Написати програму, яка перевіряє, чи є введене число простим (ділиться тільки на 1 і на себе).

    # todo 5. Користувач вводить рядок тексту, а програма замінює всі голосні літери (а, е, є, и, і, ї, о, у, ю, я) на символ '*'.



if __name__ == '__main__':
    main()

