import pprint

# 1 завдання
def even_numbers(user):
    res = []
    x = 1
    while x <= user :
        x += 1
        if x % 2 == 0 :
            res += [x]
    return res




def main():
    # 1 завдання
    user_number = int(input("Введіть до куда порахувати парні числа: "))
    pprint.pprint(even_numbers(user_number), width=40, compact=True)

    # todo 2. Користувач вводить 5 чисел. Програма підраховує та виводить суму тільки додатних чисел.

    # todo 3. Створити програму, яка запитує у користувача число n і виводить таблицю множення для цього числа від 1 до 10.

    # todo 4. Написати програму, яка перевіряє, чи є введене число простим (ділиться тільки на 1 і на себе).

    # todo 5. Користувач вводить рядок тексту, а програма замінює всі голосні літери (а, е, є, и, і, ї, о, у, ю, я) на символ '*'.



if __name__ == '__main__':
    main()

